meeting/minutes/2023/03-21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 027 Minutes 2023-03-21</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 027 Minutes 2023-03-21</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Draft Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/7]</code></a></li>
<li><a href="#administrivia">1. Administrivia</a>
<ul>
<li><a href="#roll-call">1.1. Roll call <code>[8/12]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#approve-minutes">1.3. Approve minutes of the previous meeting</a></li>
<li><a href="#next-meeting">1.4. Next meeting</a></li>
<li><a href="#open-actions">1.5. Review of open action items <code>[3/9]</code></a></li>
</ul>
</li>
<li><a href="#technical-agenda">2. Technical Agenda</a>
<ul>
<li><a href="#pr-391">2.1. PR #391: addressed typographical errors; adjusted Unicode character discussion…</a></li>
<li><a href="#pr-393">2.2. PR #393: Clarify explanations of functions/function items</a></li>
<li><a href="#pr-394">2.3. PR #394: Minor correction to fn:parse-uri</a></li>
<li><a href="#pr-395">2.4. PR #395: Make the (non-)hierarchical nature of URIs explicit</a></li>
<li><a href="#pr-396">2.5. PR #396: Deep-equal, no failure when comparing functions</a></li>
<li><a href="#pr-400">2.6. PR #400: Issue 400: ranking of type patterns</a></li>
<li><a href="#iss-399">2.7. Issue #399: Using Multilevel Hierarchy and Abstraction…deep-equal</a></li>
</ul>
</li>
<li><a href="#aob">3. Any other business</a>
<ul>
<li><a href="#pr-360">3.1. Issue #360: Issue 314 array composition and decomposition</a></li>
<li><a href="#h-82D9098A-13BA-48D2-86FC-76591E041F8B">3.2. Local union types</a></li>
</ul>
</li>
<li><a href="#adjourned">4. Adjourned</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Draft Minutes</h2>
<div class="outline-text-2" id="text-minutes">
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/7]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-023-01: NW to review the stylesheets for functions across XPath and XSLT</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-03: MK to revise and expand technical detail in PR #375</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-04: RD to remove the note in 15.5.15 of functions and operators.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-027-01:  MK to update the text for next-match wrt type() matching</li>
</ul>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call <code>[8/12]</code></h3>
<div class="outline-text-3" id="text-roll-call">
<p>
Regrets: BTW, MSM, DN
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Anthony (Tony) Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Sasha Firsov (SF)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="off"><code>[&#xa0;]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP)</li>
<li class="off"><code>[&#xa0;]</code> C. M. Sperberg-McQueen (MSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Scribe</i>. <i>Chair</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2023/03-21.html">the agenda</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2023/03-14.html">the minutes of the previous meeting</a>.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
The next meeting <a href="../../agenda/2023/03-28.html">is scheduled for Tuesday, 28 March 2023</a>.
</p>

<p>
ATTENTION: This meeting is scheduled at 16:00 local time in Europe and
the UK. The United States switched to Daylight Saving Time starting on
Sunday, 12 March 2023. Europe and the UK will switch to summer time on
26 March 2023. This meeting will return to its “usual” time, one hour
<b>earlier</b> than last week in the United States.
</p>

<p>
No regrets heard.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[3/9]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-023-01: NW to review the stylesheets for functions across XPath and XSLT</li>
<li class="on"><code>[X]</code> QT4CG-024-01: MK to add namespace-uri-for-prefix argument changes to the compatibility appendix</li>
<li class="on"><code>[X]</code> QT4CG-024-02: DN to develop an alternative proposal for deep-action.</li>
<li class="on"><code>[X]</code> QT4CG-025-02: MK to make the context function properties simple values instead of functions</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-03: MK to revise and expand technical detail in PR #375</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-025-04: RD to remove the note in 15.5.15 of functions and operators.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-026-01: MK to write a summary paper that outlines the decisions we need to make on “value sequences”</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-391" class="outline-3">
<h3 id="pr-391"><span class="section-number-3">2.1.</span> PR #391: addressed typographical errors; adjusted Unicode character discussion…</h3>
<div class="outline-text-3" id="text-pr-391">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-391">pull request #391</a>
</p>

<ul class="org-ul">
<li>Some discussion of the naunces of the U+four-leading-digits convention.</li>
<li>JK may try to improve the consistency; would CSS styles for Oxygen be useful?</li>
<li>MK please make sure you don’t use an editor that changes whitespace!</li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-393" class="outline-3">
<h3 id="pr-393"><span class="section-number-3">2.2.</span> PR #393: Clarify explanations of functions/function items</h3>
<div class="outline-text-3" id="text-pr-393">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-393">pull request #393</a>
</p>

<ul class="org-ul">
<li>MK walks us through the PR; this is editorial in that it makes no
changes to grammar or implementation but does make broad changes to
the prose of the spec.
<ul class="org-ul">
<li>… Changed data model to use “function items” instead of
“functions” because you need the distinction.</li>
</ul></li>
<li>RD: Is also consistent with map items and array items.</li>
<li>MK: Changes the title of the section and explains why
<ul class="org-ul">
<li>… Changed “implementation” to “body”</li>
</ul></li>
<li>MK: Next let’s look at XQuery:
<ul class="org-ul">
<li>… Added a discussion of categories of functions (application,
system, or external functions) and the distinctions between them.</li>
<li>… Context dependence is different in the three cases</li>
</ul></li>
<li>RD: This lays the groundwork for external framework bindings.</li>
<li>MK: I’m not suggesting we do that, but yes, it’s a start.
<ul class="org-ul">
<li>… Rewrote the section on partial function application to give
separate sets of rules for static and dynamic calls. Bundling it
into a single set of rules had become too complex.
<ul class="org-ul">
<li>… And that’s about it.</li>
</ul></li>
</ul></li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-394" class="outline-3">
<h3 id="pr-394"><span class="section-number-3">2.3.</span> PR #394: Minor correction to fn:parse-uri</h3>
<div class="outline-text-3" id="text-pr-394">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-394">pull request #394</a>
</p>

<ul class="org-ul">
<li>NW: This is almost too trivial for review. Basically, if you omit
the “/”, the rest of the algorithm fails.</li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-395" class="outline-3">
<h3 id="pr-395"><span class="section-number-3">2.4.</span> PR #395: Make the (non-)hierarchical nature of URIs explicit</h3>
<div class="outline-text-3" id="text-pr-395">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-395">pull request #395</a>
</p>

<ul class="org-ul">
<li>NW: This one is a little more interesting. Basically, the functions
<code>fn:parse-uri</code> and <code>fn:build-uri</code> should be reversible. If the parse
function doesn’t record whether or not it treated the URI as a
hierarchical URI or not, then it’s not always possible for the build
function to do the right thing.</li>
<li>MK: What about the question of file URIs and UNC names?</li>
<li>NW: That’ll be in my next PR, I wanted to clear these so I didn’t
have too big a merge tangle.</li>
<li>RD: The WHAT WG has notes about file URIs too.</li>
<li>NW: Thanks. I’ll look at that too.</li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-pr-396" class="outline-3">
<h3 id="pr-396"><span class="section-number-3">2.5.</span> PR #396: Deep-equal, no failure when comparing functions</h3>
<div class="outline-text-3" id="text-pr-396">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-396">pull request #396</a>
</p>

<ul class="org-ul">
<li>NW: I propose we wait until DN is present.</li>
</ul>

<p>
General agreement.
</p>
</div>
</div>

<div id="outline-container-pr-400" class="outline-3">
<h3 id="pr-400"><span class="section-number-3">2.6.</span> PR #400: Issue 400: ranking of type patterns</h3>
<div class="outline-text-3" id="text-pr-400">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-400">pull request #400</a>
</p>

<ul class="org-ul">
<li>MK: This is mostly about XSLT, but I found some bugs in the pattern grammar
<ul class="org-ul">
<li>… Added type <code>type()</code> keyword to wrap a type. That was already in the proposal.</li>
<li>… What’s new is what we do about priorities.
<ul class="org-ul">
<li>… Import precedence first</li>
<li>… Priority next
<ul class="org-ul">
<li>… All type patterns have the same priority (0)</li>
</ul></li>
<li>… Type patterns are distinguished according to the type hierarchy
<ul class="org-ul">
<li>… Discard supertypes (because you have a more specific one)</li>
<li>… With special rules for predicates (predicates win)</li>
<li>… If you’re left with a single rule, that’s it, otherwise do
the same thing you would for any other case of duplicate
matching templates.</li>
</ul></li>
</ul></li>
</ul></li>
<li>JL: I assume next-match will allow you to go to a less specific one?</li>
<li>MK: Yes, I don’t think the rules don’t have to change.</li>
</ul>

<p>
ACTION QT4CG-027-01:  MK to update the text for next-match wrt type() matching
</p>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-iss-399" class="outline-3">
<h3 id="iss-399"><span class="section-number-3">2.7.</span> Issue #399: Using Multilevel Hierarchy and Abstraction…deep-equal</h3>
<div class="outline-text-3" id="text-iss-399">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-399">issue #399</a>
</p>

<ul class="org-ul">
<li>NW: I propose we wait until DN is present.</li>
</ul>

<p>
General agreement again.
</p>
</div>
</div>
</div>

<div id="outline-container-aob" class="outline-2">
<h2 id="aob"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-aob">
<ul class="org-ul">
<li>NW: Apologies, I’ve let the agenda run a bit short this week. Shall
we pick some more items?</li>
<li>RD: Could we look at local union types and some things like that?</li>
<li>MK: Yes, we could do. Looking at the PRs, #368 has open actions, 
but we could do #360.</li>
</ul>

<p>
Agreement to look at #360.
</p>
</div>

<div id="outline-container-pr-360" class="outline-3">
<h3 id="pr-360"><span class="section-number-3">3.1.</span> Issue #360: Issue 314 array composition and decomposition</h3>
<div class="outline-text-3" id="text-pr-360">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-360">issue #360</a>
</p>

<ul class="org-ul">
<li>MK: Balisage paper from last year
<ul class="org-ul">
<li>… This is about doing navigation across arrays and maps</li>
<li>… I started with an abstraction the “parcel”, but I’ve moved to a
concrete representation</li>
<li>… Let’s review…
<ul class="org-ul">
<li>… Splits maps and arrays into two sections for editorial convenience</li>
<li>(Abandonning the diff version; too much text moved around)</li>
<li>… Looking at 19 Arrays
<ul class="org-ul">
<li>… New functions available to users, array:members and array:of</li>
<li>… A value record is a map with a single key “value”</li>
<li>… Looking at he specification for those functions, starting at array:members</li>
<li>… What’s interesting his how it’s used. Need more use cases.</li>
</ul></li>
</ul></li>
</ul></li>
<li>RD: Do we have a corresponding proposal for map:members and map:of?</li>
<li>MK: Not yet, but my plan is to do that next.
<ul class="org-ul">
<li>… The problem with map is what we already have map:entries and
that’s not precisely what I’d like. Would be better if it returned
a map with two keys.</li>
</ul></li>
<li>RD: With this proposal you could potentially do array:of(map:members(…))</li>
<li>MK: Yes.</li>
</ul>

<p>
Touching briefly on provenance, and agreeing to keep it separate.
</p>

<ul class="org-ul">
<li>MK: The other primitives you need are how to get back. You can use
“?” and just <code>map('value':.)</code>
<ul class="org-ul">
<li>… We could provide syntactic sugar, but this seems managable</li>
</ul></li>
<li>ML: What’s interesting is that these new functions get used in the
description of many of the other functions, for example
array:insert-before()</li>
<li>CG: Could we possibly have an atomization of the array records?
<ul class="org-ul">
<li>… You can use them as input for arbitrary functions an you would
get them to the right type.</li>
</ul></li>
<li>MK: I think the problem is if what I’ve called value records were a
new data type, then we could certainly say atomization works on it.
Or that it was implicitly coerced to an array. Because I’ve tried to
make it a concrete reuse of maps, it’s harder to give it any special
magic behavior. There’s a tradeoff.</li>
<li>JL: There are no implications if I chose to use a map with a value
key, that wouldn’t be special would it?</li>
<li>MK: No.</li>
</ul>

<p>
Proposal: Accept this PR.
</p>

<p>
Accepted.
</p>
</div>
</div>

<div id="outline-container-h-82D9098A-13BA-48D2-86FC-76591E041F8B" class="outline-3">
<h3 id="h-82D9098A-13BA-48D2-86FC-76591E041F8B"><span class="section-number-3">3.2.</span> Local union types</h3>
<div class="outline-text-3" id="text-h-82D9098A-13BA-48D2-86FC-76591E041F8B">
<ul class="org-ul">
<li>RD: Local union types were added before the CG started. I was going
to suggest we look at that.</li>
<li>MK: Let’s look at 3.6.2.1 in XQuery
<ul class="org-ul">
<li>… The proposal is that the semantics are based on XSD union types.
It has to be atomic types or union types.</li>
<li>… But the grammar just says <code>ItemType</code>, probably so you can put an
enum in. We could restrict it to a type name so you have to name
the enumerated type.</li>
</ul></li>
<li>RD: Or we could introduce a local element union type that’s an
atomic type or an enum type.</li>
<li>MK: Yes, that would possibly work.</li>
</ul>

<p>
MK reviews the semantics
</p>

<ul class="org-ul">
<li>MK: The subsumption rules are defined, but they’re the same as XSD.
<ul class="org-ul">
<li>… It’s really just a way of saying that you can use a union type
just like it was in a scheme, but you don’t have to write a schema
to do it.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-adjourned" class="outline-2">
<h2 id="adjourned"><span class="section-number-2">4.</span> Adjourned</h2>
<div class="outline-text-2" id="text-adjourned">
</div>
</div>
</div>
</body>
</html>